# Cryptocurrency price collector

I was asked to make a program which would collect the prices of the top 100 coins from the website www.kucoin.com every 5 minutes. I chose to input it into a SQL database which can then be accessed by others.

Import packages which will be needed

In [1]:
import json
import pandas as pd
import numpy as np
import requests
from time import localtime, strftime
from sqlalchemy import create_engine
import time

Get coins prices from website, extract correct dictionary of coin prices and convert to pandas dataframe.

In [2]:
current_time=strftime("%Y-%m-%d %H:%M:%S", localtime())
response_prices=requests.get('https://api.kucoin.com/api/v1/prices')
coins_prices=response_prices.json()
current_time=strftime("%Y-%m-%d %H:%M:%S", localtime())

In [3]:
coins_prices=coins_prices['data']

In [4]:
df_prices = pd.DataFrame(coins_prices.items())
df_prices

         0             1
0     AGLD    1.07013479
1     SURV    0.01980990
2      DFI    3.56878351
3      GLM    0.34597290
4     XTAG    0.37918950
..     ...           ...
655   MOVR   85.84747893
656    YOP    0.19179585
657    XMR  164.40206452
658  FTM3S    0.16858425
659   COTI    0.25219203

[660 rows x 2 columns]

Convert data types of prices to float, sort coins according to prices (highest to lowest), and remove all but the top 100 coins by price.

In [5]:
df_prices.dtypes

0    object
1    object
dtype: object

In [6]:
df_prices[1]=df_prices[1].astype('float')

In [7]:
df_prices.dtypes

0     object
1    float64
dtype: object

In [8]:
df_prices = df_prices.sort_values(by = 1, ascending=False)
df_prices

        0             1
396  WBTC  4.037530e+04
368   BTC  4.034274e+04
116  RBTC  4.016459e+04
479   YFI  2.253886e+04
235   ETH  2.890115e+03
..    ...           ...
633   UFO  1.170000e-05
230   SOS  2.240000e-06
384   BTT  2.070000e-06
264   NFT  2.010000e-06
140  ELON  8.700000e-07

[660 rows x 2 columns]

In [9]:
df_prices=df_prices.iloc[0:100,:]
df_prices

         0             1
396   WBTC  40375.302663
368    BTC  40342.741935
116   RBTC  40164.592533
479    YFI  22538.860104
235    ETH   2890.114969
..     ...           ...
517  FORTH      6.637317
619   DYDX      6.478238
248   PDEX      6.476437
168   FLOW      6.450224
225   ORAI      6.298147

[100 rows x 2 columns]

Sort coins according to alphabetical order, transpose table so that prices for each new 5 minutes can be added in row format, add a column ('timestamp') which depicts the local time that the price request was made, add a timestamp for this first request, and export this table to SQL.

In [10]:
df_prices = df_prices.sort_values(by = 0)
df_prices

          0             1
470    AAVE    149.102479
521  AAVE3S     14.135265
313   ALICE      8.111054
38       AR     29.765872
203    ATOM     28.312651
..      ...           ...
40    YFDAI    193.396491
479     YFI  22538.860104
426     ZEC    115.515705
433     ZEN     38.347159
535     ZKT     11.061527

[100 rows x 2 columns]

In [11]:
coin_list = df_prices[0].tolist()

In [12]:
df_prices_tp = df_prices.transpose()
df_prices_tp

,470,521,313,38,203,215,529,484,491,242,...,28,458,657,217,172,40,479,426,433,535
0,AAVE,AAVE3S,ALICE,AR,ATOM,AURY,AVAX,AXC,AXS,BADGER,...,WNXM,XCH,XMR,XRP3S,XVS,YFDAI,YFI,ZEC,ZEN,ZKT
1,149.102479,14.135265,8.111054,29.765872,28.312651,8.754375,87.12455,11.703549,56.474214,10.005,...,31.415704,74.464514,164.402065,12.681137,10.98549,193.396491,22538.860104,115.515705,38.347159,11.061527

In [13]:
df_prices_tp.columns=df_prices_tp.iloc[0]
df_prices_tp=df_prices_tp.drop(0)
df_prices_tp

,AAVE,AAVE3S,ALICE,AR,ATOM,AURY,AVAX,AXC,AXS,BADGER,...,WNXM,XCH,XMR,XRP3S,XVS,YFDAI,YFI,ZEC,ZEN,ZKT
1,149.102479,14.135265,8.111054,29.765872,28.312651,8.754375,87.12455,11.703549,56.474214,10.005,...,31.415704,74.464514,164.402065,12.681137,10.98549,193.396491,22538.860104,115.515705,38.347159,11.061527

In [14]:
df_prices_tp.insert(0, 'timestamp', current_time)
price_history=df_prices_tp.copy()

In [15]:
price_history=price_history.drop(1)
price_history

Empty DataFrame
Columns: [timestamp, AAVE, AAVE3S, ALICE, AR, ATOM, AURY, AVAX, AXC, AXS, BADGER, BAL, BCH, BCH3S, BCHSV, BNB, BOND, BTC, CAKE, COMP, CREAM, CVX, DASH, DCR, DERO, DEXE, DOT, DPI, DYDX, EGLD, ENS, ETC, ETH, ETH2, FIL, FLOW, FORTH, FTT, FXS, GAFI, GGC, GTC, HAPI, HNT, HT, HYDRA, ICP, ILV, KCS, KDA, KSM, LINK, LPT, LTC, LUNA, LYXE, MKR, MLN, MOVR, NDAU, NEAR, NEO, NIF, NMR, ORAI, PAXG, PDEX, PLU, PROM, PYR, QNT, QTUM, QUICK, RBTC, REP, RMRK, SFUND, SOL, SPI, STRK, STRONG, SUSHI3S, TIME, TRB, UNI, UNI3S, UNIC, UQC, WAVES, WBTC, WHALE, WNXM, XCH, XMR, XRP3S, XVS, YFDAI, YFI, ZEC, ZEN, ...]
Index: []

[0 rows x 101 columns]

In [ ]:
engine = create_engine('mysql+pymysql://root:Superman3@localhost:3306/coin_prices')
                                 
price_history.to_sql('price_history', engine, index=False)

The following is a loop which will download the prices of all of the coins which are in the SQL table created above and add this row of prices (along with the time of the price request) to the created SQL table. This loop is designed to repeat every 5 minutes.

In [ ]:
starttime = time.time()

while True:
    response_prices=requests.get('https://api.kucoin.com/api/v1/prices')
    coins_prices=response_prices.json()
    current_time=strftime("%Y-%m-%d %H:%M:%S", localtime())

    coins_prices=coins_prices['data']

    df_prices = pd.DataFrame(coins_prices.items())

    df_prices[1]=df_prices[1].astype('float')

    df_prices=df_prices[df_prices[0].isin(coin_list)]
    df_prices = df_prices.sort_values(by = 0)
    df_prices_tp = df_prices.transpose()
    df_prices_tp.columns=df_prices_tp.iloc[0]
    df_prices_tp=df_prices_tp.drop(0)
    df_prices_tp.insert(0, 'timestamp', current_time)

    df_prices_tp.to_sql('price_history', engine, if_exists='append', index=False)
    time.sleep(300.0 - ((time.time() - starttime) % 300.0))